<?php

if (!defined('BASEPATH')) {
    exit('No direct script access allowed');
} //if

include dirname(__FILE__) . '/../AC_Controller.php';

class Logout extends AC_Controller
{

    /*=====  contructor  ======*/

    /*
     * __construct
     * -
     * @input -
     * @output -
     * @author 61160079 Adithep Phompha
     * @Create Date 2563-12-11
     */

    public function __construct()
    {
        parent::__construct();

    } //__construct

    // =====================================================================================================================
    // =====================================================================================================================

    /*=====  เรียกหน้า view  ======*/

    // =====================================================================================================================
    // =====================================================================================================================

    /*=====  ajax  ======*/

    /*
     * logout_ajax
     * ใช้เรียกหน้าจอออกจากระบบ แล้วไปที่หน้าจอเข้าสู่ระบบ
     * @input -
     * @output ออกจากระบบ หน้าจอเข้าสู่ระบบ
     * @author 61160082 Areerat Pongurai
     * @Create Date 2564-03-11
     */

    public function logout_ajax()
    {

        $this->remove_session();
        echo json_encode("success");
        // $this->output_mk($this->config->item('ac_v_user_folder') . "v_login");

    } // logout_ajax

    // =====================================================================================================================
    // =====================================================================================================================

} //end class Logout