<?php
/*
 * Da_ac_user
 * จัดการข้อมูลในตาราง ac_user (ที่เกี่ยวกับ insert update และ delete)
 * @author 61160082 Areerat Pongurai
 * @Create 2564-03-04
 */

include_once 'AC_Model.php';

class Da_ac_user extends AC_Model
{

    // PK is ud_id
    // FK is -

    public $us_id;
    public $us_name;
    public $us_pass;
    public $us_last_login;

    // =====================================================================================================================
    // =====================================================================================================================
    // =====================================================================================================================

    /*=====  contructor  =====*/

    /*
     * __construct
     * -
     * @input -
     * @output -
     * @author 61160082 Areerat Pongurai
     * @Create Date 2564-03-04
     */

    public function __construct()
    {
        parent::__construct();
    } //__construct

    // =====================================================================================================================
    // =====================================================================================================================
    // =====================================================================================================================

    /*=====  insert  =====*/

    /*
     * insert
     * เพิ่มข้อมูล 1 record ในตาราง
     * @input ud_id,us_name,us_pass, us_last_login
     * @output -
     * @author 61160082 Areerat Pongurai
     * @Create Date 2564-03-04
     */

    public function insert()
    {
        $sql = "INSERT INTO {$this->db_name}.ac_user (us_name,us_pass)
                VALUES(?,?)";
        $this->db->query($sql, array($this->us_name, $this->us_pass));
    } //insert

    // =====================================================================================================================
    // =====================================================================================================================
    // =====================================================================================================================

    /*=====  update  =====*/

    /*
     * update
     * แก้ไขข้อมูลในตารางทั้ง record โดยอ้างอิงจาก id
     * @input ud_id,us_name,us_pass, us_last_login, us_id
     * @output -
     * @author 61160082 Areerat Pongurai
     * @Create Date 2564-03-04
     */

    public function update()
    {
        $sql = "UPDATE {$this->db_name}.ac_user
        SET	us_name =?,us_pass =?
        WHERE us_id =?";
        $this->db->query($sql, array($this->us_name, $this->us_pass, $this->us_id));
    } //update

    // =====================================================================================================================
    // =====================================================================================================================
    // =====================================================================================================================

    /*=====  delete  =====*/

    /*
     * delete
     * ลบข้อมูล 1 record ในตารางโดยอ้างอิงจาก id
     * @input us_id
     * @output -
     * @author 61160082 Areerat Pongurai
     * @Create Date 2564-03-04
     */

    public function delete()
    {
        $sql = "DELETE FROM {$this->db_name}.ac_user
        WHERE us_id=?";
        $this->db->query($sql, array($this->us_id));
    } //delete

    // =====================================================================================================================
    // =====================================================================================================================
    // =====================================================================================================================

} //end class Da_ac_user